<a href="https://colab.research.google.com/github/tanakorn4640/bootcamp_projects/blob/main/DataTransformation_HW_Batch6.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data transformation FlightNYC2013

# Install packages

In [ ]:
install.packages("nycflights13")

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

In [ ]:
library(tidyverse)
library(nycflights13)
library(glue)

## Overview Data

In [ ]:
fli_r <- flights
fli_r |> glimpse()

Rows: 336,776
Columns: 19
$ year           <int> 2013, 2013, 2013, 2013, 2013, 2013, 2013, 2013, 2013, 2…
$ month          <int> 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1…
$ day            <int> 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1…
$ dep_time       <int> 517, 533, 542, 544, 554, 554, 555, 557, 557, 558, 558, …
$ sched_dep_time <int> 515, 529, 540, 545, 600, 558, 600, 600, 600, 600, 600, …
$ dep_delay      <dbl> 2, 4, 2, -1, -6, -4, -5, -3, -3, -2, -2, -2, -2, -2, -1…
$ arr_time       <int> 830, 850, 923, 1004, 812, 740, 913, 709, 838, 753, 849,…
$ sched_arr_time <int> 819, 830, 850, 1022, 837, 728, 854, 723, 846, 745, 851,…
$ arr_delay      <dbl> 11, 20, 33, -18, -25, 12, 19, -14, -8, 8, -2, -3, 7, -1…
$ carrier        <chr> "UA", "UA", "AA", "B6", "DL", "UA", "B6", "EV", "B6", "…
$ flight         <int> 1545, 1714, 1141, 725, 461, 1696, 507, 5708, 79, 301, 4…
$ tailnum        <chr> "N14228", "N24211", "N619AA", "N804JB", "N668DN", "N394…
$ origin         <chr> "EWR", "LGA", "JFK", "JFK", "LGA", "EWR", "EWR", "LGA",…
$ dest           <chr> "IAH", "IAH", "MIA", "BQN", "ATL", "ORD", "FLL", "IAD",…
$ air_time       <dbl> 227, 227, 160, 183, 116, 150, 158, 53, 140, 138, 149, 1…
$ distance       <dbl> 1400, 1416, 1089, 1576, 762, 719, 1065, 229, 944, 733, …
$ hour           <dbl> 5, 5, 5, 5, 6, 5, 6, 6, 6, 6, 6, 6, 6, 6, 6, 5, 6, 6, 6…
$ minute         <dbl> 15, 29, 40, 45, 0, 58, 0, 0, 0, 0, 0, 0, 0, 0, 0, 59, 0…
$ time_hour      <dttm> 2013-01-01 05:00:00, 2013-01-01 05:00:00, 2013-01-01 0…

## Cleaning Data

check percentage than how data have Not NA

In [ ]:
sum ( complete.cases(fli_r) ) / nrow(fli_r)

[1] 0.9719992

it have row that not NA 97% and NA 3%

## Drop Data

In [ ]:
fli_1 <- drop_na(fli_r)

## Example Data

In [ ]:
head(fli_1, 5)

  year month day dep_time sched_dep_time dep_delay arr_time sched_arr_time
1 2013 1     1   517      515             2         830      819
2 2013 1     1   533      529             4         850      830
3 2013 1     1   542      540             2         923      850
4 2013 1     1   544      545            -1        1004     1022
5 2013 1     1   554      600            -6         812      837
  arr_delay carrier flight tailnum origin dest air_time distance hour minute
1  11       UA      1545   N14228  EWR    IAH  227      1400     5    15
2  20       UA      1714   N24211  LGA    IAH  227      1416     5    29
3  33       AA      1141   N619AA  JFK    MIA  160      1089     5    40
4 -18       B6       725   N804JB  JFK    BQN  183      1576     5    45
5 -25       DL       461   N668DN  LGA    ATL  116       762     6     0
  time_hour
1 2013-01-01 05:00:00
2 2013-01-01 05:00:00
3 2013-01-01 05:00:00
4 2013-01-01 05:00:00
5 2013-01-01 06:00:00

## Question 1 Which top 3 carrier had most flight in 31 Dec 2013

In [ ]:
df1 <- fli_1 |>
  filter(year == 2013, month == 12, day == 31) |>
  count(carrier) |>
  arrange( desc(n)) |>
  left_join(airlines, by = "carrier") |>
  head(3) |>
  rename(count_flights = n) 

df1 |>
  select(carrier , count_flights, name)

  carrier count_flights name
1 B6      159           JetBlue Airways
2 UA      133           United Air Lines Inc.
3 DL      124           Delta Air Lines Inc.

## Question 2 Top 5 carrier had most  average departure delays

In [ ]:
df2 <- fli_1 |>
  filter(dep_delay > 0) |>
  group_by(carrier) |> 
  summarise(depart_delay = mean(dep_delay) ) |>
  arrange( desc(depart_delay)) |>
  left_join(airlines, by = "carrier") |>
  head(5) 
  df2

  carrier depart_delay name
1 OO      58.00000     SkyWest Airlines Inc.
2 YV      52.87069     Mesa Airlines Inc.
3 EV      50.19481     ExpressJet Airlines Inc.
4 9E      48.47393     Endeavor Air Inc.
5 F9      45.18235     Frontier Airlines Inc.

## Question 3 Which top 10 had most average air time in Dec 2013

In [ ]:
df3 <- fli_1 |>
  filter(year == 2013, month == 12) |>
  group_by(carrier) |> 
  summarise(m_airtime = mean(air_time)) |>
  arrange( desc(m_airtime)) |>
  left_join(airlines, by = "carrier") |>
  head(10)
  tibble(df3)

   carrier m_airtime name
1  HA      630.7143  Hawaiian Airlines Inc.
2  VX      354.0000  Virgin America
3  AS      338.4074  Alaska Airlines Inc.
4  F9      243.7377  Frontier Airlines Inc.
5  UA      224.2924  United Air Lines Inc.
6  AA      200.7724  American Airlines Inc.
7  DL      183.6727  Delta Air Lines Inc.
8  WN      162.1257  Southwest Airlines Co.
9  B6      161.5279  JetBlue Airways
10 FL      106.5000  AirTran Airways Corporation

## Question 4  What are the top 3 popular destinations in July 2013

In [ ]:
df4 <- fli_1 |> 
  filter(year == 2013, month == 7) |>
  count(dest) |>
  arrange( desc(n)) |>
  head(3)
  df4

  dest n
1 LAX  1494
2 ORD  1487
3 ATL  1448

## Question 5 Top 10 carrier had most average distance

In [ ]:
df5 <- fli_1 |>
  select(carrier, distance) |>
  group_by(carrier) |>
  summarise(avg_dis = mean(distance)) |>
  arrange( desc(avg_dis)) |>
  left_join(airlines, by = "carrier") |>
  head(10)
  df5

   carrier avg_dis   name
1  HA      4983.0000 Hawaiian Airlines Inc.
2  VX      2499.4326 Virgin America
3  AS      2402.0000 Alaska Airlines Inc.
4  F9      1620.0000 Frontier Airlines Inc.
5  UA      1531.3214 United Air Lines Inc.
6  AA      1343.2799 American Airlines Inc.
7  DL      1237.9791 Delta Air Lines Inc.
8  B6      1069.6896 JetBlue Airways
9  WN       996.9714 Southwest Airlines Co.
10 FL       664.7874 AirTran Airways Corporation

# RPostgreSQL

## Install package

In [ ]:
install.packages("RPostgreSQL")

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

In [ ]:
library(RPostgreSQL)

## Connect to server

In [ ]:
con <- dbConnect(
  PostgreSQL(),
  host = "tiny.db.elephantsql.com",
  dbname = "kjqqmmfy",
  port = 5432,
  user = "kjqqmmfy",
  password = "aD8YH4w6E1U9vxubOTanaXHI8ZAZzTCI"
)

In [ ]:
dbWriteTable(con, "top_most_flights", df1, row.names = F)
dbWriteTable(con, "top_dep_delays", df2, row.names = F)
dbWriteTable(con, "top_avg_airtime", df3, row.names = F)
dbWriteTable(con, "top_pop_dest", df4, row.names = F)
dbWriteTable(con, "top_avg_dist", df5, row.names = F)

[1] TRUE

[1] TRUE

[1] TRUE

[1] TRUE

[1] TRUE

In [ ]:
dbListTables(con)

[1] "top_most_flights" "top_dep_delays"   "top_avg_airtime"  "top_pop_dest"
[5] "top_avg_dist"

## Get data from Question 1 - Question 5

In [ ]:
dbGetQuery(con, "SELECT * FROM top_most_flights")
dbGetQuery(con, "SELECT * FROM top_dep_delays")
dbGetQuery(con, "SELECT * FROM top_avg_airtime")
dbGetQuery(con, "SELECT * FROM top_pop_dest")
dbGetQuery(con, "SELECT * FROM top_avg_dist")

  carrier count_flights name
1 B6      159           JetBlue Airways
2 UA      133           United Air Lines Inc.
3 DL      124           Delta Air Lines Inc.

  carrier depart_delay name
1 OO      58.00000     SkyWest Airlines Inc.
2 YV      52.87069     Mesa Airlines Inc.
3 EV      50.19481     ExpressJet Airlines Inc.
4 9E      48.47393     Endeavor Air Inc.
5 F9      45.18235     Frontier Airlines Inc.

   carrier m_airtime name
1  HA      630.7143  Hawaiian Airlines Inc.
2  VX      354.0000  Virgin America
3  AS      338.4074  Alaska Airlines Inc.
4  F9      243.7377  Frontier Airlines Inc.
5  UA      224.2924  United Air Lines Inc.
6  AA      200.7724  American Airlines Inc.
7  DL      183.6727  Delta Air Lines Inc.
8  WN      162.1257  Southwest Airlines Co.
9  B6      161.5279  JetBlue Airways
10 FL      106.5000  AirTran Airways Corporation

  dest n
1 LAX  1494
2 ORD  1487
3 ATL  1448

   carrier avg_dis   name
1  HA      4983.0000 Hawaiian Airlines Inc.
2  VX      2499.4326 Virgin America
3  AS      2402.0000 Alaska Airlines Inc.
4  F9      1620.0000 Frontier Airlines Inc.
5  UA      1531.3214 United Air Lines Inc.
6  AA      1343.2799 American Airlines Inc.
7  DL      1237.9791 Delta Air Lines Inc.
8  B6      1069.6896 JetBlue Airways
9  WN       996.9714 Southwest Airlines Co.
10 FL       664.7874 AirTran Airways Corporation

## Close Connection

In [ ]:
dbDisconnect(con)

[1] TRUE